{
  "personalInfo": {
    "name": "Ajay Mittapally",
    "phone": "(470) 962-0998",
    "email": "ajaymittapally70@gmail.com",
    "links": {
      "linkedin": "LinkedIn",
      "github": "GitHub",
      "portfolio": "Portfolio"
    }
  },
  "HomeInfo":"Experienced Full Stack Developer with 5 years of expertise in crafting high-performance websites. Combining deep knowledge of UI libraries (React, Next.js) with strong backend capabilities (Java Spring Boot, Node, Express) and AWS to deliver responsive, scalable solutions that delight users. Committed to writing modular, fully tested code using industry-standards. Proven track record of delivering solutions that exceed both technical requirements and user expectations.",
  "FooterInfo":"Full Stack developer",
  "AboutInfo":"I'm Ajay Mittapally, a full-stack Software Engineer with a Master's in Computer Science from Kennesaw State University and 5+ years of experience building scalable web applications. I specialize in React.js, Node.js, Java Spring Boot, and Python, with strong skills in AWS, microservices, and performance optimization. Currently, I work at Quartet AI, where I focus on modern web architecture using Next.js and React Query. My past roles at Datics and Tata Consultancy Services involved designing REST APIs, optimizing UI performance, and deploying cloud-native solutions. Outside of work, I love building side projects—from e-commerce platforms to AI-powered tools—and continuously exploring new tech.",
  "workExperience": [
    {
      "company": "Quartet AI",
      "location": "Atlanta, USA",
      "position": "Software Engineer",
      "duration": "Aug 2024 – Present",
      "responsibilities": [
        "Integrated React Query for efficient data fetching and caching, reducing load times by 30% and refining user experience.",
        "Implemented SSR and SSG with Next.js to improve SEO, TTFB, and page load performance.",
        "Enhanced performance using code-splitting, lazy loading, and memoization, reducing load time by 25%."
      ]
    },
    {
      "company": "Datics",
      "location": "Atlanta, USA",
      "position": "Software Engineer",
      "duration": "Aug 2023 – May 2024",
      "responsibilities": [
        "Developed REST APIs for authentication and product catalog using Java Spring Boot, Spring Security, Hibernate, and PostgreSQL.",
        "Optimized endpoints with pagination, indexing, and caching to reduce server load and improve response times by 25%.",
        "Integrated Swagger3 for API documentation and schema generation.",
        "Built unit and regression tests using JUnit, Mockito, and TestNG.",
        "Implemented scalable state management with Redux Toolkit and React Hooks."
      ]
    },
    {
      "company": "Tata Consulting Services",
      "location": "Hyderabad, India",
      "positions": [
        {
          "title": "Software Developer",
          "duration": "Sep 2021 – Dec 2022",
          "responsibilities": [
            "Migrated finance application front-end from PHP to React + TypeScript ensuring API compatibility.",
            "Built UI for real-time financial data with React, JavaScript (ES6+), and Next.js.",
            "Used Redux to reduce duplicate API calls and improve performance.",
            "Expanded Java Spring Boot REST APIs for dynamic financial calculations.",
            "Mentored junior developers on React and Spring Boot."
          ]
        },
        {
          "title": "Associate Software Developer",
          "duration": "Jan 2020 – Sep 2021",
          "responsibilities": [
            "Migrated PL/SQL hospitality product to AWS cloud; created core microservices with Node.js and Express.",
            "Containerized services using Docker and deployed on Amazon EKS using Kubernetes.",
            "Enhanced UI in Angular to reduce task clicks and improve efficiency.",
            "Optimized CI/CD pipeline using Jenkins and Groovy, cutting build time by 30%."
          ]
        }
      ]
    }
  ],
  "competencies": {
    "languages": ["Java", "Python", "JavaScript", "SQL", "Bash Scripting", "HTML", "CSS"],
    "frameworks": ["Flask", "Django", "Spring", "Spring Boot", "React", "Redux/Context API", "Bootstrap CSS", "tailwind CSS", "Angular"],
    "cloud": ["Amazon Web Services", "Azure", "GCP", "AWS CLI", "S3 Management", "Cloud computing", "Cloud practitioner", "Amazon EKS", "ECS", "Docker"],
    "skillset": ["Algorithms", "Data Structures", "Problem-solving", "architecture design", "microservices", "REST webservices"],
    "libsAndTechStacks": [
      "Spring boot", "Django Rest", "MVC", "CI/CD", "Angular", "React", "SciPy", "Pandas", "NumPy", "Jenkins", "Kubernetes",
      "Docker", "Oracle DB", "PostgreSQL", "MySQL DB", "Mongo DB", "Tomcat", "WebLogic server", "SQL Alchemy",
      "Git", "GitHub", "JIRA", "Agile", "Scrum", "Kanban"
    ]
  },
  "education": [
    {
      "institution": "Kennesaw State University",
      "location": "Marietta, Georgia",
      "degree": "Master of Science",
      "major": "Computer Science",
      "graduationDate": "May 2024",
      "courseWork": ["Advanced Algorithms", "Cloud Computing", "Database systems", "Machine Learning", "Cryptography"]
    },
    {
      "institution": "Anurag Group of Institutions, CVSR",
      "location": "Hyderabad, India",
      "degree": "Bachelor of Engineering",
      "major": "Electronics and Communication",
      "gpa": "3.6/4.0",
      "graduationDate": "May 2019",
      "courseWork": ["Object Oriented Programming Java", "Computer Networks", "Cloud Computing IOT", "Big data analytics"]
    }
  ],
  "projects": [
    {
      "name": "GERRNCART E-commerce Shopping site",
      "description": "Created a grocery shopping website using the MERN stack with JWT authentication, Stripe payment, cart, inventory, and admin dashboard using Tailwind and Material UI."
    },
    {
      "name": "YouTube Clone",
      "description": "End-to-end clone of YouTube using React and Redux, YouTube API for data, and responsive layout using CSS Grid and Flexbox."
    },
    {
      "name": "Reusable React Components",
      "description": "Created reusable React components including:",
      "components": [
        "Interactive Accordion with customizable styling and animation options.",
        "Star Rating system with half-star support and interactive hover effects.",
        "Todo List with local storage persistence and filtering.",
        "Random Color Generator in Hex and RGB formats."
      ]
    },
    {
      "name": "Chef Claude AI",
      "description": "Built a recipe generator using Claude AI and prompt engineering with React, Node.js, Express, and styled using Tailwind and Material CSS."
    },
    {
      "name": "Deep Learning Model for CIFAR-100 Image Classification",
      "description": [
        "Built image classifiers using VGG16, VGG-19, and ResNet for CIFAR-100.",
        "Applied transfer learning, hyperparameter tuning, and data augmentation.",
        "Achieved 0.85 F1-score using evaluation metrics and cross-validation."
      ]
    },
    {
      "name": "AWS S3 Automation Using Bash",
      "description": [
        "Wrote Bash scripts to manage S3 buckets using AWS CLI.",
        "Automated file sync between local and S3 buckets for backups.",
        "Used scripting for listing and managing stored data efficiently."
      ]
    }
  ],
  "achievementsAndCertifications": [
    "AWS Cloud Practitioner",
    "Certified python developer (Hacker rank)",
    "Networks and Deep Learning – Deep learning AI",
    "Bash Basic Certificate (Hacker rank)",
    "SQL Basic Certificate (Hacker Rank)",
    "Led team of 50 to win silver in Entrepreneur Summit at IIT Bombay",
    "President of DAKSHAT, managing 3 sectors: retail, event management, treasury",
    "Convenor of CVSR college cultural fest 2018, managing 12 committees",
    "Won Silver in D-Zone arena 2k18, inter college table tennis championship",
    "Headed Tech-Workshop under IETE for 200 students on robotics"
  ]
}
